backend/artillery/stockloadtest.yml
config:
  target: 'http://localhost:8000'
  phases:
    # - duration: 10
    #   arrivalRate: 5
    #   name: Test
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 35
      name: Ramp up load
    - duration: 600
      arrivalRate: 35
      name: Sustained load
  payload:
    - path: "stocks.csv"
      fields:
        - "id"
        - "symbol"
        - "name"
        - "value"
        - "volume"
        - "open"
        - "close"
        - "gains"
        - "latest_trade"
    - path: "newStocks.csv"
      fields:
        - "newId"
        - "newSymbol"
        - "newName"
        - "newValue"
        - "newVolume"
        - "newOpen"
        - "newClose"
        - "newGains"
        - "newLatestTrade"
    - path: "editStocks.csv"
      fields:
        - "editId"
        - "editSymbol"
        - "editName"
        - "editValue"
        - "editVolume"
scenarios:
- name: "Get details of one stock"
  flow:
    - post:
        url: "/user/signin"
        json: 
          username: "admin"
          password: "Password1!"
        jar: true
    - get:
        url: "/stock/getOne?symbol={{ symbol }}"
- name: "Get number of last page"
  flow:
    - post:
        url: "/user/signin"
        json: 
          username: "admin"
          password: "Password1!"
        jar: true
    - get:
        url: "/stock/lastpagenum?limit=10"
- name: "Get many stocks"
  flow:
    - post:
        url: "/user/signin"
        json: 
          username: "admin"
          password: "Password1!"
        jar: true
    - post:
        url: "/stock/getMany"
        json: 
          filters:
           - value: "10"
          options:
           - valueMode: "1"
- name: "Create a stock"
  flow:
    - post:
        url: "/user/signin"
        json: 
          username: "admin"
          password: "Password1!"
        jar: true
    - post:
        url: "/stock/create"
        json: 
          symbol: "{{ newSymbol }}"
          name: "{{ newName }}"
          value: "{{ newValue }}"
          volume: "{{ newVolume }}"
- name: "Edit a stock"
  flow:
    - post:
        url: "/user/signin"
        json: 
          username: "admin"
          password: "Password1!"
        jar: true
    - post:
        url: "/stock/edit"
        json: 
          symbol: "{{ editSymbol }}"
          name: "{{ editName }}"
          value: "{{ editValue }}"
          volume: "{{ editVolume }}"