backend/artillery/stockloadtest.yml
config:
  target: 'http://localhost:8000/stock'
  phases:
    - duration: 10
      arrivalRate: 5
      name: Test
    # - duration: 60
    #   arrivalRate: 5
    #   name: Warm up
    # - duration: 120
    #   arrivalRate: 5
    #   rampTo: 50
    #   name: Ramp up load
    # - duration: 600
    #   arrivalRate: 50
    #   name: Sustained load
  payload:
    - path: "stocks.csv"
      fields:
        - "id"
        - "symbol"
        - "name"
        - "value"
        - "volume"
        - "open"
        - "close"
        - "gains"
        - "latest_trade"
    - path: "newStocks.csv"
      fields:
        - "newId"
        - "newSymbol"
        - "newName"
        - "newValue"
        - "newVolume"
        - "newOpen"
        - "newClose"
        - "newGains"
        - "newLatestTrade"
    - path: "editStocks.csv"
      fields:
        - "editId"
        - "editSymbol"
        - "editName"
        - "editValue"
        - "editVolume"
        - "editOpen"
        - "editClose"
        - "editGains"
        - "editLatestTrade"
scenarios:
- name: "Get details of one stock"
  flow:
    - get:
        url: "/getOne"
        json: 
          symbol: "{{ symbol }}"
- name: "Get number of last page"
  flow:
    - get:
        url: "/lastpagenum"
        json: 
          limit: "10"
- name: "Get many stocks"
  flow:
    - post:
        url: "/getMany"
        json: 
          filters:
           - value: "10"
          options:
           - valueMode: "1"
- name: "Create a stock"
  flow:
    - post:
        url: "/create"
        cookies: 
          token: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6IjYyZWZlMTNmZTA4YmIzNzYyY2U1YTdjYiIsInVzZXJuYW1lIjoiYWRtaW4iLCJlbWFpbCI6ImFkbWluQHN0b2NrdHJhZGluZ3N5c3RlbS5jb20iLCJmaXJzdE5hbWUiOiJBZG1pbiIsImxhc3ROYW1lIjoiQWNjb3VudCIsInJlcG9ydHMiOltdLCJjcmVkaXQiOjUwMDAwLCJyb2xlIjoiQWRtaW4iLCJpc0RlbGV0ZWQiOmZhbHNlLCJjYXJkRGV0YWlscyI6W10sInBhc3N3b3JkIjoiIiwiYWN0aXZhdGlvbkRhdGUiOiIyMDIyLTA4LTA3VDE1OjU4OjU1LjYwM1oiLCJpYXQiOjE2NTk4OTI5NjMsImV4cCI6MTY2MDQ5Nzc2M30.xTl-ipbyrno7HBbNVcNhoVA8NNflfXfHlbF-a7ox7Xs"
        json: 
          - symbol: "{{ newSymbol }}"
          - name: "{{ newName }}"
          - value: "{{ newValue }}"
          - volume: "{{ newVolume }}"
- name: "Edit a stock"
  flow:
    - post:
        url: "/edit"
        cookies: 
          token: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6IjYyZWZlMTNmZTA4YmIzNzYyY2U1YTdjYiIsInVzZXJuYW1lIjoiYWRtaW4iLCJlbWFpbCI6ImFkbWluQHN0b2NrdHJhZGluZ3N5c3RlbS5jb20iLCJmaXJzdE5hbWUiOiJBZG1pbiIsImxhc3ROYW1lIjoiQWNjb3VudCIsInJlcG9ydHMiOltdLCJjcmVkaXQiOjUwMDAwLCJyb2xlIjoiQWRtaW4iLCJpc0RlbGV0ZWQiOmZhbHNlLCJjYXJkRGV0YWlscyI6W10sInBhc3N3b3JkIjoiIiwiYWN0aXZhdGlvbkRhdGUiOiIyMDIyLTA4LTA3VDE1OjU4OjU1LjYwM1oiLCJpYXQiOjE2NTk4OTI5NjMsImV4cCI6MTY2MDQ5Nzc2M30.xTl-ipbyrno7HBbNVcNhoVA8NNflfXfHlbF-a7ox7Xs"
        json: 
          - symbol: "{{ editSymbol }}"
          - name: "{{ editName }}"
          - value: "{{ editValue }}"
          - volume: "{{ editVolume }}"